"""
字符
 ↓
编码规则
 ↓
字节


字符编码体系（并不是严格标准分类）
│
├─ ASCII
│
├─ ISO-8859 系列
│
├─ GB 系列
│   ├─ GB2312
│   ├─ GBK
│   └─ GB18030
│
├─ Big5
│
└─ Unicode
    ├─ UTF-8
    ├─ UTF-16
    └─ UTF-32



Unicode：给字符编号。解决：这个字符是什么？编号是多少？
UTF-8：规定这些编号怎么保存成字节。解决：这个 Unicode 编号具体怎么转换成字节保存

Unicode 管“字符是什么”，UTF-8 管“字符怎么变成字节”。


因此：
    字符 "中"
        ↓ Unicode
    码点 U+4E2D
        ↓ UTF-8
    字节 E4 B8 AD


字符：中

       Unicode
          ↓
       U+4E2D
          ↓
    ┌─────┼─────┐
    ↓     ↓     ↓
 UTF-8  UTF-16 UTF-32
    ↓     ↓     ↓
  不同的字节表示方式    

    

| 字符   | Unicode 码点 | UTF-8 | UTF-16 | UTF-32 |
| ---- | ---------- | ----: | -----: | -----: |
| `A`  | U+0041     |  1 字节 |   2 字节 |   4 字节 |
| `中`  | U+4E2D     |  3 字节 |   2 字节 |   4 字节 |
| `😀` | U+1F600    |  4 字节 |   4 字节 |   4 字节 |



"""


print(ord("中"))    # 20013
print(hex(ord("中")))   # 0x4e2d


# -------------------------------------------------------------


a = "akiragifa"
print("a的类型：", type(a))      # a的类型： <class 'str'>


b = a.encode()
print("a编码后的类型：", type(b))     # a编码后的类型： <class 'bytes'>


c = b.decode()
print("a编码再解码后的类型：", type(c))     # a编码再解码后的类型： <class 'str'>

# -------------------------------------------------------------

d = "李晨星"
e = d.encode("utf-8")
print(e)    # b'\xe6\x9d\x8e\xe6\x99\xa8\xe6\x98\x9f'
