num1 = 3
num2 = 10

sum = num1 + num2
print(sum)

# 变量只有在赋值后才会被创建，使用变量前必须要赋值

a = 666
a = 999
print(a)    # 999，从上向下运行

b = a
print(b)    # 999

c = 1
c = "哈哈"
print(c)    # 哈哈，同一变量可以直接赋不同类型的数据

# -------------------------------------------------------------


"""
PEP 8 命名规范

| 类型     | 推荐写法    | 示例                 |
| ----    | ----------- | ------------------ |
| 普通变量 | 小写+下划线  | `vehicle_mass`     |
| 函数    | 小写+下划线  | `calculate_mass()` |
| 方法    | 小写+下划线  | `get_node_data()`  |
| 类      | 首字母大写   | `VehicleModel`     |
| 常量     | 全大写      | `MAX_SIZE`         |
| 私有变量 | 前缀 `_`    | `_node_list`       |
| 特殊方法 | 双下划线    | `__init__`         |
"""
