"""
算数运算符

| 运算符 | 名称 | 示例 | 结果 |
|---|---|---|---|
| `+` | 加法 | `5 + 2` | `7` |
| `-` | 减法 | `5 - 2` | `3` |
| `*` | 乘法 | `5 * 2` | `10` |
| `/` | 除法 | `5 / 2` | `2.5` |
| `//` | 整除（向下取整） | `5 // 2` | `2` |
| `%` | 取余、求模 | `5 % 2` | `1` |
| `**` | 幂运算 | `5 ** 2` | `25` |
"""

"""
    算术运算符中，有一个浮点数，结果也用浮点数表示；
    商 “/” 一定为浮点数，因此，有商的运算结果一定是浮点数
"""

a = 5
b = 2

print(a + b)    # 7
print(a - b)    # 3
print(a * b)    # 10
print(a / b)    # 2.5，商一定是浮点数，能整除也是浮点数
print(a // b)   # 2，商向下取整，类型随动
print(a % b)    # 1，取余数
print(a ** b)   # 25，取幂

print(type(7 // 2))     # <class 'int'>
print(type(7.0 // 2))   # <class 'float'>
print(type(7 // 2.0))   # # <class 'float'>