"""
    占位符：
        %: %d整型，%s字符串，%f浮点型
        format()
        f
"""

"""
    % 格式化
"""

name = "akiragifa"
age = 20

print("我的名字是%s，今年%d岁" % (name, age))

# -------------------------------------------------------------

a = 123
print("%6d" % a)    #   123，不足六位，前面补空格
print("%06d" % a)   #000123，不足六位，前面补0

# -------------------------------------------------------------

b = 1.23
print("%f" % b)     # 1.230000，默认小数点后6位

c = 1.2345679
print("%f" % c)     # 1.234568，默认小数点后6位，多于6位四舍五入

d = 2.34567
print("%.4f" % d)    # 2.3457，保留4位

# -------------------------------------------------------------

print("我是%%的1%%" % ())   # 我是%的1%，两个%%，输出 “%” 本身


# -------------------------------------------------------------


"""
    f 格式化
"""


mass = 1500
output = f"Vehicle mass is {mass} kg"
print(output)   # Vehicle mass is 1500 kg