while True:
    print("打印打印")
    break


# -------------------------------------------------------------

total = 0
i = 1

while i <= 100:
    sum += i
    i += 1

print(total)


# -------------------------------------------------------------

i = 1

while i <= 3:
    print(f"这是第{i}次外循环")
    j = 1
    while j <= 3:
        print(f"这是第{j}次内循环")
        j += 1
    i += 1


# -------------------------------------------------------------

num = int(input("请输入数字，输入0退出："))

while num != 0:
    print("你输入的数字是：", num)
    num = int(input("请输入数字，输入0退出："))
    continue

print("程序结束")