"""
for 变量 in 可迭代对象:
    要重复执行的代码

"""

strin = "helloworld"
for i in strin:
    print(i, end = ' ')   # h e l l o w o r l d

# -------------------------------------------------------------

print("\n")

for i in range(5):
    print(i, end = ' ')     # 0 1 2 3 4

# -------------------------------------------------------------

print("\n")

for i in range(1, 6):
    print(i, end = ' ')     # 1 2 3 4 5


# -------------------------------------------------------------

print("\n")

for i in range(1, 6, 2):
    print(i, end = ' ')     # 1 3 5


# -------------------------------------------------------------

print("\n")

"""
    1~100求和
"""

total = 0

for i in range(1, 101):
    total += i

print(total)      # 5050


# -------------------------------------------------------------

print("\n")

for i in [5, 6, 7, 8, 9]:
    print(i, end = ' ')     # 5 6 7 8 9

# -------------------------------------------------------------

print("\n")

names = ["小红", "小蓝", "小黄"]

for name in names:
    print(name, end = ' ')      # 小红 小蓝 小黄