"""
Python 常见内置数据类型
│
├─ 数值类型
│  ├─ int
│  ├─ float
│  └─ complex
│
├─ 布尔类型
│  └─ bool
│
├─ 序列类型
│  ├─ str
│  ├─ list
│  ├─ tuple
│  └─ range
│
├─ 映射类型
│  └─ dict
│
├─ 集合类型
│  ├─ set
│  └─ frozenset
│
└─ 空值类型
   └─ None

"""

"""
| 类型      | 底层核心思想  | 关注的问题             |
| ------- | ------- | ----------------- |
| `list`  | 连续/动态数组 | 元素排在第几个           |
| `tuple` | 固定数组式序列 | 元素排在第几个           |
| `str`   | 字符序列    | 字符排在第几个           |
| `set`   | 哈希表     | 元素是否存在            |
| `dict`  | 哈希表     | 某个 key 对应什么 value |


"""

"""
1、集合是无序的，里面元素唯一；
2、可以用于元组或列表去重

元素
 ↓
hash(element)
 ↓
哈希值
 ↓
映射到哈希表槽位
 ↓
存储


因此：
    set 无序
    不是因为 Python 故意把元素打乱

    而是因为：

    它本来就不是按照“第几个元素”的方式组织数据，
    而是按照 hash 值组织数据。

    
这也直接解释了 set 的几个核心特点：
无序
 ↓
没有下标

哈希表
 ↓
成员查询很快

根据元素本身定位
 ↓
元素必须可哈希

同一个值定位到相同逻辑位置
 ↓
天然适合去重
    
"""


"""
hash 不同
→ 一定不是相同元素

hash 相同
→ 不一定相同

hash 相同 + == True
→ set 认为重复

"""

set1 = {1, 2, 3}
print(set1)     # {1, 2, 3}
print(type(set1))   # <class 'set'>


"""定义空集合set()"""
dic2 = {}
set2 = set()

print(dic2)     # {}
print(type(dic2))   # <class 'dict'>

print(set2)     # set()
print(type(set2))   # <class 'set'>


# -------------------------------------------------------------

"""
无序性
"""

set3 = {"a", "b", "c", "d", "e", "f", "g"}
print(set3)     # 根据元素 hash 值，确定元素应放在哪个位置，每次运行 hash值都不同，因为 Python 对字符串 hash 使用了哈希随机化

print(hash("a"))
print(hash("b"))
print(hash("c"))
print(hash("d"))
print(hash("e"))
print(hash("f"))
print(hash("g"))

"""
"akira"
   ↓
计算 hash
   ↓
根据 hash 找到对应槽位
   ↓
检查这个位置是不是 "akira"

这就是 set 查询快的重要原因，平均时间复杂度通常都是 O(1)

"""

print(hash(1))  # 1
print(hash(2))  # 2
print(hash(3))  # 3
print(hash(4))  # 4
print(hash(5))  # 5
print(hash(6))  # 6
print(hash(7))  # 7

set4 = {1, 2, 3, 4, 5, 6, 7}
print(set4)     # {1, 2, 3, 4, 5, 6, 7} ，看起来有序，实则仍按 hash值 排序



print(hash(3))  # 3
print(hash(100))  # 100
print(hash(28))  # 28
print(hash(7))  # 7
set5 = {100, 3, 28, 7}
print(set5)     # {3, 100, 28, 7}


# -------------------------------------------------------------

"""
唯一性
"""

set6 = {"haha", "haha", 1, 2, 3, 4, 5, 4, 3, 2, 1, "xixi", "xixi"}
print(set6)     # {1, 2, 3, 4, 5, 'haha', 'xixi'} ，其中一种输出


# -------------------------------------------------------------

"""
集合常见操作
添加 add：一次添加一个元素
添加 update：传入的元素拆分全部添加
删除 remove：有就删除，没有报错
删除 pop：进行无需排列，左边第一个删除
删除 discard：选择元素删除，有就删，没有不做任何操作
"""


"""add"""
set7 = {"haha", "xixi", 1, 2, 3}
set7.add(1)

print(set7)     # {"haha", "xixi", 1, 2, 3} ，其中一种输出


# -------------------------------------------------------------

"""update"""

set8 = {"haha", "xixi", 1, 2, 3}
set8.update("567")  # update参数为可迭代对象

print(set8)     # {1, 2, 3, 'xixi', '5', 'haha', '7', '6'}，其中一种输出


# -------------------------------------------------------------

"""remove"""

set9 = {"haha", "xixi", 1, 2, 3}
set9.remove("haha")

print(set9)     # {1, 2, 3, 'xixi'}，其中一种输出


# -------------------------------------------------------------

"""pop"""

set10 = {"haha", "xixi", 1, 2, 3}
set10.pop()

print(set10)    # {1, 2, 3, 'haha'} / {2, 3, 'haha', 'xixi'}


# -------------------------------------------------------------

"""discard"""

set11 = {"haha", "xixi", 1, 2, 3}

set11.discard("haha")
print(set11)    # {1, 2, 3, 'xixi'}，其中一种输出

set11.discard(5)
print(set11)    # {1, 2, 3, 'xixi'}，其中一种输出


# -------------------------------------------------------------

"""
交集和并集

&：交集
|：并集

"""

a = {1, 2, 3, 4}
b = {3, 4, 5, 6}
c = {5, 6, 7, 8}

print(a & b)    # {3, 4}
print(a & c)    # set() ，空集合

print(a | b)    # {1, 2, 3, 4, 5, 6}