"""
Python 里的浅拷贝（shallow copy）和深拷贝（deep copy），
核心是在处理“容器里面还有可变对象”时，决定到底复制到哪一层


浅拷贝会：新建一个最外层对象，但内部元素仍然引用原来的对象
深拷贝会：不仅复制最外层对象，还会递归复制内部对象


浅拷贝复制容器本身，深拷贝递归复制容器内部的可变对象


| 操作                 | 外层对象 | 内部可变对象 | 修改内部是否互相影响 |
| ------------------ | ---- | ------ | ---------- |
| `b = a`            | 共用   | 共用     | 会          |
| `b = a.copy()`     | 新建   | 共用     | 会          |
| `copy.copy(a)`     | 新建   | 共用     | 会          |
| `copy.deepcopy(a)` | 新建   | 递归复制   | 通常不会       |


深浅拷贝的问题，本质上是“对象之间是否还共享可变子对象”

"""

# -------------------------------------------------------------

"""浅拷贝"""

a = [[1, 2], [3, 4]]
b = a.copy()

"""
内部结构是：

a ──→ 外层列表A
       │
       ├──→ [1, 2]
       └──→ [3, 4]

b ──→ 外层列表B
       │
       ├──→ [1, 2]
       └──→ [3, 4]

因此：
"""

print(a)    # [[1, 2], [3, 4]]
print(b)    # [[1, 2], [3, 4]]

print(id(a))    # 2244565717696，其中一种输出
print(id(b))    # 2244565656576，其中一种输出，id与上面不同

print(a is b)   # False
print(a[0] is b[0])     # True

print(id(a[0]))     # 3185769340992
print(id(b[0]))     # 3185769340992，其中一种输出，id与上面相同


a[0].append(100)
print(a[0])     # [1, 2, 100]
print(b[0])     # [1, 2, 100]
print(a[0] is b[0])     # True


# -------------------------------------------------------------

"""深拷贝"""

import copy

c = [[1, 2], [3, 4]]
d = copy.deepcopy(c)

print(c is d)   # False
print(c[0] is d[0])     # False

"""
内部结构是：

a → 外层列表A
     │
     ├──→ 子列表A1 [1, 2]
     └──→ 子列表A2 [3, 4]


b → 外层列表B
     │
     ├──→ 子列表B1 [1, 2]
     └──→ 子列表B2 [3, 4]

完全独立

"""


# -------------------------------------------------------------

"""
一个例子记住
"""


import copy

a = [[1, 2], [3, 4]]

b = a
c = copy.copy(a)
d = copy.deepcopy(a)

"""
关系是：

a ─────────────┐
b ─────────────┘
       ↓
   同一个外层列表


c → 新外层列表
     但内部子列表和 a 共用


d → 新外层列表
     内部子列表也重新复制

所以：
"""

print(a is b)   # True
print(a is c)   # False
print(a is d)   # False

print(a[0] is b[0])     # True
print(a[0] is c[0])     # True
print(a[0] is d[0])     # False



# -------------------------------------------------------------

"""
为什么普通整数看不出深浅拷贝区别

1, 2, 3是不可变对象，不能做：1.append(...)，也不能把整数对象本身修改成另一个整数
普通整数本身不存在“浅拷贝还是深拷贝”这个区别；
深浅拷贝主要讨论的是容器对象内部还引用了其他对象时，复制到哪一层


a[0] = 100，这不是“修改整数 1，而是 让 a[0] 改为引用另一个整数对象 100

"""

x = [1, 2, 3]
y = x.copy()

x[0] = 100

print(x)    # [100, 2, 3]
print(y)    # [1, 2, 3]

"""
原来：

x[0] ──→ 1
y[0] ──→ 1


执行：
x[0] = 100


变成：

x[0] ──→ 100

y[0] ──→ 1


只是 x 的第 0 个位置改为引用一个新对象 100。

原来的整数 1 完全没被修改。

所以 y 不受影响

"""

q = 10

m = copy.copy(q)
n = copy.deepcopy(q)

print(q is m)   # True，整数是不可变对象
print(q is n)   # True，整数是不可变对象

"""
Python 根本没有必要重新创建一个所谓“深拷贝的 10”。

因为：
    共享一个不可变对象
和：
    各自拥有一个内容完全一样的不可变对象

在修改行为上没有区别——反正谁都不能修改它，所以 copy 模块可以直接返回原对象

"""



"""
总结：
整数本身不适合说成是浅拷贝或深拷贝。它是不可变对象，
因此即使浅拷贝和原对象共享同一个整数，也不会产生修改互相影响的问题；
对整数直接做 copy() 和 deepcopy()，通常甚至会直接返回同一个对象。
"""