"""
Python 中的可变对象（mutable object）和不可变对象（immutable object），核心区别只有一句话：

对象创建之后，它自身的内容能不能被修改。


| 类型      | 可变性 |
| ------- | --- |
| `int`   | 不可变 |
| `float` | 不可变 |
| `bool`  | 不可变 |
| `str`   | 不可变 |
| `tuple` | 不可变 |
| `bytes` | 不可变 |
| `list`  | 可变  |
| `dict`  | 可变  |
| `set`   | 可变  |


之前看到很多字符串方法：
    replace()
    upper()
    lower()
    strip()
通常都不会直接修改原字符串。这是因为
    str 是不可变对象


而列表：
    a.extend(...)
    a.sort()
    a.reverse()
    a.remove(...)
    a.clear()
与 list.sort()，返回None，而不是返回一个新列表，它强调：
    我直接修改原对象


"""

a = 10
c = 10
print(id(a))    # 140708489716936
print(id(c))    # 140708489716936

a = 20
print(id(a))    # 140708489717256


# -------------------------------------------------------------

list1 = [1, 2, 3]
print(id(list1))    # 1483917058112，其中一个输出结果

list1.append(4)
print(id(list1))    # 1483917058112，其中一个输出结果


# -------------------------------------------------------------

"""
tuple 是不可变的，但这里有一个细节：

tuple 的不可变性是指： tuple 内部保存的“引用关系”不能改变


tuple
 ├──→ list对象
 └──→ 3

不能：t[0] = 新对象
但你可以修改：t[0] 指向的那个 list 对象

所以：
    不可变容器不代表它内部引用的所有对象也一定不可变。
这个点非常重要。

"""

tuple1 = ([1, 2], 3)
tuple1[0].append(100)
print(tuple1)   # ([1, 2, 100], 3)


"""
    tuple 本身结构不可变，但 tuple 是否可哈希，还取决于内部元素是否可哈希   
"""

print(hash((1, 2, 3)))      # 529344067295497451
# print(hash(([1, 2], 3)))    # 报错，list不可哈希，所以外层tuple也不可哈希


# -------------------------------------------------------------

"""
从可变性理解set的元素不能是list


假如允许：
    [1, 2]
    ↓ hash
    ↓
    存到 set 某个槽位
然后你再修改：
    [1, 2]
    ↓
    [1, 2, 3]
那么对象内容变化，就可能破坏哈希表的定位逻辑


所以
    list
    dict
    set
都不能直接作为 set 元素

"""

# s = {[1, 2]}    # 报错，list是可变对象