"""
unpacking: 拆包

拆包就是把一个“装着多个值”的对象展开，然后把这些值分别交给变量、函数参数或新的容器


Python 拆包
│
├── 普通拆包
│   a, b = [1, 2]
│
├── 扩展拆包
│   a, *b = [1, 2, 3, 4]
│
├── for 中拆包
│   for a, b in data:
│
├── 函数调用拆包
│   func(*args)
│
└── 字典拆包
    func(**kwargs)

"""


"""tuple拆包"""
from time import perf_counter


a, b = (1, 2)
print(a, b)     # 1 2


"""list拆包"""
a, b = [10, 20]
print(a, b)     # 10 20


"""字符串拆包"""
a, b, c = "ABC"
print(a, b, c)  # A B C



"""set通常不拆包，因为set无序"""



"""dict拆包，默认得到的是key的拆包"""
a, b = {"PROP": "shell", "MAT": "MAT_063"}
print(a, b)     # PROP MAT



comp1 = {
    "PROP": "shell",
    "MAT": "MAT_063"
}

a, b = comp1.items()
print(a, b)     # ('PROP', 'shell') ('MAT', 'MAT_063')


# -------------------------------------------------------------

"""
* 扩展包

"""

a, *b = [1, 2, 3, 4]
print(a, b)     # 1 [2, 3, 4]


*a, b = [1, 2, 3, 4]
print(a, b)     # [1, 2, 3] 4


a, *b, c = [1, 2, 3, 4]
print(a, b, c)  # 1 [2, 3] 4


# -------------------------------------------------------------

"""
    _ 常用于忽略不需要的值

"""

a, _, b = [1, 2, 3]
print(a, b)  # 1 3


a, *_, b = [1, 2, 3, 4]
print(a, b)     # 1 4

# -------------------------------------------------------------

"""
拆包用于交换变量
"""

a = 10
b = 20
a, b = b, a
print(a, b)


# -------------------------------------------------------------

"""
嵌套拆包
"""

a, (b, c) = [1, (2, 3)]
print(a, b, c)  # 1 2 3


# -------------------------------------------------------------

"""
拆包不只出现在赋值语句里
"""

def add(a, b):
    return a + b

nums = [10, 20]
print(add(*nums))   #30， 表示把列表拆成多个位置元素，等价于 add(10, 20)


# -------------------------------------------------------------

"""
字典拆包

*
常用于位置参数拆包

**
常用于字典 / 关键字参数拆包
"""

def introduce(name, age):
    print(name, age)

person = {
    "name": "Tom",
    "age": 18
}

introduce(**person)     # Tom 18


# --------------------------

"""**合并字典"""

a = {"name": "Tom"}
b = {"age": 18}

c = {**a, **b}
print(c)    # {'name': 'Tom', 'age': 18}



# -------------------------------------------------------------

"""
容器本身也可以用 * 拆开
"""

a = [1, 2]
b = [3, 4]

c = [*a, *b]
print(c)    # [1, 2, 3, 4]




"""
最容易混淆的：* 到底是什么意思

你会看到 * 出现在不同位置。

例如：

a, *b = [1, 2, 3]

这里是：

收集拆包剩余元素。

结果：

a = 1
b = [2, 3]

---------------------------------------------

而：

func(*args)

这里是：

把 iterable 拆成多个位置参数。

---------------------------------------------

再例如函数定义：

def func(*args):
    pass

这里又表示：

收集传进来的多个位置参数。

所以 * 的具体含义要结合位置来看。

但背后的思想其实很统一：

都是在处理“多个值”。


"""